<template>
	<view>
		<!-- 导航栏 -->
		<Nav></Nav>
		<!-- 影片分类 -->
		<scroll-view scroll-x class="bg-white nav" scroll-with-animation :scroll-left="scrollLeft">
			<view 
			class="cu-item" 
			:class="index==TabCur?'text-green cur':''" 
			v-for="(item,index) in scorllClass" 
			:key="index" 
			:data-id="item.id"
			@tap="tabSelect" 
			>
				{{item.name}}
			</view>
		</scroll-view>
		<!-- 分类选择器 -->
		<!-- 影片列表 -->
		 <view class="video-list">
		 	<view class="single-video" v-for="(item, index) in movieList" :key="index">
		 		<image :src="item.src" mode=""></image>
		 		<view class="video-name">
		 			 {{item.title}}
		 		</view>
		 	</view>
			
		</view>
		
		<!--  没有更多了 -->
		<view class="not-have-anymore">
			没有更多了
		</view>
		
	</view>
</template>

<script>
	import Nav from '../../components/Navigator/index.vue'
	export default {
		components:{
			Nav,
		},
		data() {
			return {
				scorllClass: [
					{
						'id': 0,
						'name': ' 全部'
					},{
						'id': 1,
						'name': '电影'
					},{
						'id': 2,
						'name': '电视剧'
					},{
						'id': 3,
						'name': '动漫'
					},{
						'id': 4,
						'name': '微电影'
					},{
						'id': 5,
						'name': '节目'
					},{
						'id': 6,
						'name': ' 榜单'
					}	
				],
				TabCur: 0,
				scrollLeft: 0,
				movieList:[{
						'id': 0,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 1,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 2,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 3,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 4,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 5,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 6,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 7,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 8,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 9,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					},{
						'id': 10,
						'title': '大约在冬季 2019',
						'src': 'https://cn2.3days.cc/1577875712879260.jpeg',
						'actors': ['马思纯','霍建华', '魏大勋', '张瑶', '林柏宏', '文淇', '侯佩岑', '齐秦'],
						'desc': '　1991年齐秦狂飙演唱会上，北师大才女安然（马思纯 饰）和来自台北的摄影师齐啸（霍建华 饰）因缘相识，曲终人散后再度重逢的二人陷入热恋，然而不是勇敢就一定能拥有爱，不是所有再见都能再见！在漂泊岁月中，弄丢了挚爱的我们，是否还能安然无恙？没有我的日子里，你是否能保重自己？2019年，齐啸和安然能否重逢？',
						'url': 'https://jx.7639616.com/?url=https://cn7.kankia.com/hls/20200101/5c361debcd70cbd3cd118bc9d24186a4/1577874894/index.m3u8'
					}
				]
							
			}
		},
		methods: {
			tabSelect(e) {
				this.TabCur = e.currentTarget.dataset.id;
				this.scrollLeft = (e.currentTarget.dataset.id - 1) * 60
			},
		}
	}
</script>

<style>
	@import url('./index.css');
</style>
